package com.company.java009;

// 1. 클래스는 부품객체
// 2. 클래스는 속성(멤버변수)과 행위(멤버함수)
class A1{}

//////////////////////////////////////////////////
public class class001_oop {
	public static void main(String[] args) {	//jvm - main 구동시점
		int i = 10;
		A1 a = new A1();	// 인스턴스화 4-1. new (heap 1번지 공간 빌리기, 객체생성)
							// 4-2. A1() 초기화
							// 4-3. a 1번지라는 주소주기 
		System.out.println(a);	//com.company.java009.A1@69a3d1d
		A1 a2 = new A1();
		A1 a3 = new A1();
	}
}
//////////////////////////////////////////////////
/* [runtime data area]
----------------------------------------------------
[method : 클래스 정보, static, final : 1)공용] 
	A1.class , class001.class		2)					클래스 : 설게도
----------------------------------------------------
[heap : 동적]							[stack : 잠깐 빌리기]	객체(전체) : (a, a2, a3)
3번지 : A1{}					 	   ← a3[3번지]			인스턴스(각각) : a, a2, a3
2번지 : A1{}					 	   ← a2[2번지]
1번지 : A1{}					 	   ← a[1번지]
									 i [10]  
									| main 3)

----------------------------------------------------

*/